#include <stdio.h>

int main()
{
    printf("%s\n", "(주)킹마트");
    printf("%s\n", "사업자번호:286-81-01771");
    printf("대 표 자:%s\n", "김현주");
    printf("주    소:%s\n", "경기 고양시 일산서구 중앙로1391 레이크타운 지하1층");
    printf("전 화 번호:%s\n\n", "031-916-9200");
    
    printf("%s\n\n", "킹마트를 찾아주셔서 감사합니다.");
    
    printf("판매일:%s, 토요일 계산대:%d\n", "20-09-26 18:14", 002);
    printf("%s\n", "---------------------------------------");
    printf("%s %-12s %-7s %-7s %-7s\n", "NO.","상품명","단가","수량","금액");
    printf("%d %s\n", 001, "공주알밤술 750ml");
    printf("%12d %8d %7d %7d\n", 8809409970097, 1300, 2, 2600);
    printf("%d %s\n", 002, "웰치소다포도 1.5L");
    printf("%12d %8d %7d %7d\n", 8809409970097, 1980, 1, 1980);
    printf("%d %s\n", 003, "상추 1봉");
    printf("%12d %8d %7d %7d\n", 22001429, 1980, 1, 1980);
    printf("%d %s\n", 004, "팔도)비빔면멀티팩 5입");
    printf("%12d %8d %7d %7d\n", 8801128503051, 3980, 1, 3980);
    printf("%s\n", "---------------------------------------");
    printf("%s %22d\n", "(#)면세물품 : ", 1980);
    printf("%s %22d\n", "과 세 물 품 : ", 7782);
    printf("%s %22d\n", "부가세(VAT) : ", 778);
    printf("%s %22d\n", "합       계 : ", 10540);
    printf("%s %21d\n", "신용카드지불 : ", 10540);
	
	return 0;
}
