#include <stdio.h>

int main()
{
    printf("%s\n", "(주)킹마트");
    printf("%s\n", "사업자번호:286-81-01771");
    printf("대 표 자:%s\n", "김현주");
    printf("주    소:%s\n", "경기 고양시 일산서구 중앙로1391 레이크타운 지하1층");
    printf("전 화 번호:%s\n\n", "031-916-9200");
    
    printf("%s\n\n", "킹마트를 찾아주셔서 감사합니다.");
    
    printf("판매일:%s,토요일 계산대:%003d\n", "20-09-26 18:14", 2);
    printf("%s\n", "-----------------------------------------");
    printf("%-4s %-13s %-8s %-7s %-7s\n", "NO.","상품명","단가","수량","금액");
    printf("%003d %s\n", 1, "공주알밤술 750ml");
    printf("%15lld %8s %7d %7s\n", 8809409970097, "1,300", 2, "2,600");
    printf("%003d %s\n", 2, "웰치소다포도 1.5L");
    printf("%15lld %8s %7d %7s\n", 8801043034722, "1,980", 1, "1,980");
    printf("%003d %s\n", 3, "상추 1봉");
    printf("%15ld %8s %7d %7s\n", 22001429, "1,980", 1, "1,980");
    printf("%003d %s\n", 4, "팔도)비빔면멀티팩 5입");
    printf("%15llu %8s %7d %7s\n", 8801128503051, "3,980", 1, "3,980");
    printf("%s\n", "-----------------------------------------");
    printf("%s %25s\n", "(#)면세물품 : ", "1,980");
    printf("%s %25s\n", "과 세 물 품 : ", "7,782");
    printf("%s %25s\n", "부가세(VAT) : ", "778");
    printf("%s %25s\n", "합       계 : ", "10,540");
    printf("%s %24s\n", "신용카드지불 : ", "10,540");
	
	return 0;
}
